'''1、写一个正则，能验证是否是合法的手机号。可以了解下移动联通电信手机号的号码段

中国联通：
130，131，132，155，156，185，186，145，176
中国移动
134, 135 , 136, 137, 138, 139, 147, 150, 151,152, 157,
158, 159, 178, 182, 183, 184, 187, 188
中国电信
133,153,189
'''
import re


def phone_number():
    n = input("请输入一个手机号：")
    if re.match(r'1[3,4,5,7,8]\d{9}', n):
        print("该号码合法：", n)
        # 中国移动：
        if re.match(r"13[4,5,6,7,8,9]\d{8}", n) or \
                re.match(r"15[0,1,2,7,8,9]\d{8}", n) or \
                re.match(r"147\d{8}|178\d{8}", n) or \
                re.match(r"18[2,3,4,7,8]\d{8}", n):
            print("该号码属于：中国移动")
        # 中国联通
        elif re.match(r'13[0,1,2]\d{8}', n) or \
                re.match(r"18[5,6]\d{8}", n) or \
                re.match(r"15[5,6]\d{8}", n) or \
                re.match(r"176\d{8}", n) or \
                re.match(r"145\d{8}", n):
            print("该号码属于：中国联通")
        else:
            # 中国电信
            print("该号码属于：中国电信")
    else:
        print("请输入正确的手机号")


if __name__ == '__main__':
    phone_number()
